# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные.

my_int = 25
my_float = 98.6
my_str = "Hello world"
my_bool = True
my_tuple = (10, 20)

print(type(my_int))
print(type(my_float))
print(type(my_str))
print(type(my_bool))
print(type(my_tuple))
